app/controllers/users_controller.rb

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)